tsung/messages-tsung-file.xml
<?xml version="1.0"?>
<!DOCTYPE tsung
  SYSTEM '/usr/local/share/tsung/tsung-1.0.dtd' []>
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="15000" use_controller_vm="true"/>
  </clients>
  <servers>
    <server host="jnlai-8.3hfpeaqsam.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>
  <load>
    <arrivalphase duration="15" phase="1" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase duration="15" phase="2" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase duration="15" phase="3" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase duration="15" phase="4" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="Make Post" probability="100" type="ts_http">
      <transaction name="Get_Root">
        <request>
          <http url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Get_Register">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/register"/>
        </request>
      </transaction>
      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <setdynvars length="13" sourcetype="random_string">
        <var name="rnd_email"/>
      </setdynvars>
      <setdynvars length="13" sourcetype="random_string">
        <var name="rnd_user"/>
      </setdynvars>
      <thinktime random="true" value="2"/>
      <transaction name="Post_Register">
        <request subst="true">
         <!--  <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+up" method="POST" url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Redirect_Root">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Get_Conversations">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="/conversations"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Get_New_Conversation">
        <request>
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <dyn_variable name="authenticity_token"/>
          <http url="/conversations/new"/>
        </request>
      </transaction>
      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <setdynvars end="30" sourcetype="random_number" start="1">
        <var name="random_user_id"/>
      </setdynvars>
      <transaction name="Post_New_Conversation">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <dyn_variable name="convo_id" re="Location: http://.*/conversations/(.*)\r"/>
          <http contents="authenticity_token=%%_authenticity_token%%&amp;user_id=2&amp;body=tsung_message&amp;" method="POST" url="/conversations"/>
        </request>
      </transaction>
      <thinktime random="true" value="4"/>
      <transaction name="Redirect_To_New_Conversation">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <dyn_variable name="authenticity_token"/>
          <http url="/conversations/%%_convo_id%%"/>
        </request>
      </transaction>
      <setdynvars code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <thinktime random="true" value="2"/>
      <transaction name="Reply_To_Conversation">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http contents="authenticity_token=%%_authenticity_token%%&amp;body=message" method="POST" url="/conversations/%%_convo_id%%/messages"/>
        </request>
      </transaction>
      <transaction name="Redirect_To_Same_Conversation">
        <request subst="true">
          <!-- <match do="abort" when="nomatch">HTTP/1.1 (2|3)\d\d</match> -->
          <http url="/conversations/%%_convo_id%%"/>
        </request>
      </transaction>
    </session>
  </sessions>
</tsung>